Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetSnapshotFromDatabase(Tekla.Structures.ModelInternal.dotEnumerator_t@,System.Collections.Generic.List{System.Object}@,System.Boolean)
Enumerator:
SerializedObjects:
SelectInstances:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetSolidSerialized(Tekla.Structures.ModelInternal.dotSolid_t@,System.Collections.Generic.List{System.Object}@,System.Collections.Generic.List{Tekla.Structures.Geometry3d.Vector}@)
dotSolid:
serializedFaceList:
serializedVectorList:
Returns: